# 41. Даны три действительных числа. Выбрать из них  те, которые принадлежат интервалу ( 1, 3).

a = float(input("a: "))
b = float(input("b: "))
c = float(input("c: "))

if a > 1 & a < 3:
    print("a")

if b > 1 & b < 3:
    print("b")

if b > 1 & b < 3:
    print("b")
