# 10. Определить время падения камня на поверхность  земли с высоты А.

g = 9.8

h = float(input("A: "))

print(sqrt((2 * h) / g))
