# 4. Даны два действительных положительных числа.  Найти среднее арифметическое и среднее геометрическое  этих чисел.

import math

a = int(input("a: "))
b = int(input("b: "))

print((a + b) / 2)
print(math.sqrt(a * b))
