# 1. Даны два действительных числа а и Ь. Получить их  сумму, разность и произведение.

a = int(input("a: "))
b = int(input("b: "))

print("a + b =", a + b)
print("a - b =", a - b)
print("a * b =", a * b)
