# 3. Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.

a = int(input("a: "))

print(a * a * 6)
